
// Решил прописать все ответы в одном файле

//task 1
let a = 1, b = 1;

let c = ++a; // 2
let d = b++; // 1

//task 2

let a = 2;

let x = 1 + (a *= 2);  // a = 4, x = 5

//task 3

"" + 1 + 0 // 1
"" - 1 + 0 // -1
true + false // 1
6 / "3" // 2 
"2" * "3" // 6
4 + 5 + "px" // 9px
"$" + 4 + 5 // $45
"4" - 2 // 2 
"4px" - 2 // Nan
"  -9  " + 5 // "  -9  5"
"  -9  " - 5 // - 14
null + 1 // 1 
undefined + 1 // Nan
" \t \n" - 2 //  -2

//task 4

let a = "1"; // prompt("Первое число?", 1);
let b = "2"; // prompt("Второе число?", 2);

alert(a + b); // 12

/* Ответ. Получается 12 так как складываются не числа, а строки. 
Необходимо преобразовать в число перед сложением
alert(+a + +b); // 12
*/